class 氣味類別:
    # 來源: p32 ~ p34
    #       1 - 草地
    #       2 - 植物
    #       3 - 腐化物
    #       4 - 腐化物分解者
    # 方向:
    #       1 - 右下 ↘
    #       2 - 下   ↓
    #       3 - 左下 ↙
    #       4 - 左   ←
    #       5 - 左上 ↖
    #       6 - 上   ↑
    #       7 - 右上 ↗
    #       8 - 右   →
    def __init__(self, 來源, 大小, 方向):
        self.來源 = 來源
        self.大小 = 大小
        self.方向 = 方向


class 氣味場類別:
    def __init__(self, 世界, 地圖寬度, 地圖高度):
        self.世界 = 世界
        self.地圖寬度 = 地圖寬度
        self.地圖高度 = 地圖高度
